package com.dmdev.l2;

/**
 * Задача 2: Арифметика символов
 * Напишите программу, которая принимает два символа (тип char) и выводит сумму их числовых значений.
 */
public class Task2 {

    public static void main(String[] args) {
        char symb1 = 'в', symb2 = 'ч';
        int sum = symb1 + symb2;
        System.out.println(sum);
    }
}
